let arr = [
	1, 1, 1, 1, 
	1, 1, 0.9, 1, 
	1, 1, 1, 1
];

let log = console.log;
let sum = function () {
	let result = 0;
	for (let i = 0; i < arguments.length; i++) {
		result += arguments[i];
	}
	return result;
}


let method = function () {
	log('将小球编号，从0至11号，分成三组：(0、1、2、3)、(4、5、6、7)、(8、9、10、11)');
	log('第一次：比较(0 + 1 + 2 + 3)和(4 + 5 + 6 + 7)');
	if (sum(arr[0], arr[1], arr[2], arr[3]) > sum(arr[4], arr[5], arr[6], arr[7])) {
		log('第一次比较结果：(0 + 1 + 2 + 3) 重于 (4 + 5 + 6 + 7)');
		log('异常就在0~7中，要么0~3重，要么4~7轻');
		log('第二次：比较(0 + 5 + 6 + 7) 和 (4 + 8 + 9 + 10)');
		if (sum(arr[0], arr[5], arr[6], arr[7]) > sum(arr[4], arr[8], arr[9], arr[10])) {
			log('第二次比较结果：(0 + 5+ 6 + 7) 重于 (4 + 8 + 9 + 10)');
			log('异常球可能是0 偏重，也可能是4 偏轻');
			log('第三次：比较0和正常球');
			if (arr[0] > arr[8]) {
				log('第三次比较结果：0号比正常球重');
				log('结论：异常球为0号球，且偏重'); // 0 >
			} else if (arr[0] < arr[8]) {
				log('第三次比较结果：0号比正常球轻');
				log('--结论：异常球为0号球，且偏轻');
			} else {
				log('第三次比较结果：0号与正常球一样重');
				log('结论：异常球为4号球，且偏轻'); // 4 <
			}
		} else if (sum(arr[0], arr[5], arr[6], arr[7]) < sum(arr[4], arr[8], arr[9], arr[10])) {
			log('第二次比较结果：(0 + 5 + 6 + 7) 轻于 (4 + 8 + 9 + 10)');
			log('异常球在5、6、7中，且偏轻');
			log('第三次：比较5号和6号球');
			if (arr[5] > arr[6]) {
				log('第三次比较结果：5号比6号重');
				log('结论：异常球为6好球，且偏轻'); // 6 <
			} else if (arr[5] < arr[6]) {
				log('第三次比较结果：5号比6号轻');
				log('结论：异常球为5好球，且偏轻'); // 5 <
			} else {
				log('第三次比较结果：5号与6号一样重');
				log('结论：异常球为7好球，且偏轻'); // 7 <
			}
		} else {
			log('第二次比较结果：(0 + 5+ 6 + 7) 与 (4 + 8 + 9 + 10)一样重');
			log('异常球在1、2、3中，且偏重');
			log('第三次：比较1号和2号球');
			if (arr[1] > arr[2]) {
				log('第三次比较结果：1号比2号重');
				log('结论：异常球为1好球，且偏重'); // 1 >
			} else if (arr[1] < arr[2]) {
				log('第三次比较结果：1号比2号轻');
				log('结论：异常球为2好球，且偏重'); // 2 >
			} else {
				log('第三次比较结果：1号与2号一样重');
				log('结论：异常球为3好球，且偏重'); // 3 >
			}
		}
	} else if (sum(arr[0], arr[1], arr[2], arr[3]) < sum(arr[4], arr[5], arr[6], arr[7])) {
		log('第一次比较结果：(0 + 1 + 2 + 3) 轻于 (4 + 5 + 6 + 7)');
		log('异常就在0~7中，要么0~3轻，要么4~7重');
		log('第二次：比较(0 + 5 + 6 + 7) 和 (4 + 8 + 9 + 10)');
		if (sum(arr[0], arr[5], arr[6], arr[7]) > sum(arr[4], arr[8], arr[9], arr[10])) {
			log('第二次比较结果：(0 + 5 + 6 + 7) 重于 (4 + 8 + 9 + 10)');
			log('异常球在5、6、7中，且偏重');
			log('第三次：比较5号和6号球');
			if (arr[5] > arr[6]) {
				log('第三次比较结果：5号比6号重');
				log('结论：异常球为5好球，且偏重'); // 5 >
			} else if (arr[5] < arr[6]) {
				log('第三次比较结果：5号比6号轻');
				log('结论：异常球为6好球，且偏重'); // 6 >
			} else {
				log('第三次比较结果：5号与6号一样重');
				log('结论：异常球为7好球，且偏重'); // 7 >
			}
		} else if (sum(arr[0], arr[5], arr[6], arr[7]) < sum(arr[4], arr[8], arr[9], arr[10])) {
			log('第二次比较结果：(0 + 5 + 6 + 7) 轻于 (4 + 8 + 9 + 10)');
			log('异常球可能是0 偏轻，也可能是4 偏重');
			log('第三次：比较0和正常球');
			if (arr[0] > arr[8]) {
				log('第三次比较结果：0号比正常球重');
				log('--结论：异常球为0号球，且偏重');
			} else if (arr[0] < arr[8]) {
				log('第三次比较结果：0号比正常球轻');
				log('结论：异常球为0号球，且偏轻'); // 0 <
			} else {
				log('第三次比较结果：0号与正常球一样重');
				log('结论：异常球为4号球，且偏重'); // 4 >
			}

		} else {
			log('第二次比较结果：(0 + 5+ 6 + 7) 与 (4 + 8 + 9 + 10)一样重');
			log('异常球在1、2、3中，且偏轻');
			log('第三次：比较1号和2号球');
			if (arr[1] > arr[2]) {
				log('第三次比较结果：1号比2号重');
				log('结论：异常球为2好球，且偏轻'); // 2 <
			} else if (arr[1] < arr[2]) {
				log('第三次比较结果：1号比2号轻');
				log('结论：异常球为1好球，且偏轻'); // 1 <
			} else {
				log('第三次比较结果：1号与2号一样重');
				log('结论：异常球为3好球，且偏轻'); // 3 >
			}
		}
	} else {
		log('第一次比较结果：(0 + 1 + 2 + 3) 和 (4 + 5 + 6 + 7) 一样重');
		log('异常就在8~11中，但是不知道轻重');
		log('第二次：比较(8 + 9 + 10) 和 其他三个正常球的总重量');
		if (sum(arr[8], arr[9], arr[10]) > sum(arr[0], arr[1], arr[2])) {
			log('第二次比较结果：(8 + 9 + 10) 重于 三个正常球');
			log('异常球就在8~10中，且偏重');
			log('第三次：8号与9号比较');
			if (arr[8] > arr[9]) {
				log('第三次比较结果：8号比9号重');
				log('结论：8号为异常球，偏重');
			} else if (arr[8] < arr[9]) {
				log('第三次比较结果：8号比9号轻');
				log('结论：9号为异常球，偏重');
			} else {
				log('第三次比较结果：8号与9号一样重');
				log('结论：10号为异常球，偏重');
			}
		} else if (sum(arr[8], arr[9], arr[10]) < sum(arr[0], arr[1], arr[2])) {
			log('第二次比较结果：(8 + 9 + 10) 轻于 三个正常球');
			log('异常球就在8~10中，且偏轻');
			log('第三次：8号与9号比较');
			if (arr[8] > arr[9]) {
				log('第三次比较结果：8号比9号重');
				log('结论：9号为异常球，偏轻');
			} else if (arr[8] < arr[9]) {
				log('第三次比较结果：8号比9号轻');
				log('结论：8号为异常球，偏轻');
			} else {
				log('第三次比较结果：8号与9号一样重');
				log('结论：10号为异常球，偏轻');
			}
		} else {
			log('第二次比较结果：(8 + 9 + 10) 轻于 三个正常球');
			log('异常球就11号，不知轻重');
			log('第三次：11号与正常球比较');
			if (arr[11] > arr[0]) {
				log('第三次比较结果：11号比正常球重');
				log('结论：11号为异常球，且偏重');
			} else if (arr[11] < arr[0]) {
				log('第三次比较结果：11号比正常球轻');
				log('结论：11号为异常球，且偏轻');
			} else {
				log('第三次比较结果：11号与正常球一样重');
				log('结论：没有异常球，所有都一样');
			}
		}
	}
}

method();
